---
title: AnalysisDisplayLegendSettings
classe: Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 15
---

# AnalysisDisplayLegendSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 ColorRangeHeight { get; set; }` | `analysisDisplayLegendSettings.ColorRangeHeight` | Int32 |
| `Int32 ColorRangeWidth { get; set; }` | `analysisDisplayLegendSettings.ColorRangeWidth` | Int32 |
| `ElementId HeadingTextTypeId { get; set; }` | `analysisDisplayLegendSettings.HeadingTextTypeId` | ElementId |
| `Boolean IsValidObject { get; }` | `analysisDisplayLegendSettings.IsValidObject` | Boolean |
| `Double NumberForScale { get; set; }` | `analysisDisplayLegendSettings.NumberForScale` | Double |
| `Int32 NumberOfSteps { get; set; }` | `analysisDisplayLegendSettings.NumberOfSteps` | Int32 |
| `Double Rounding { get; set; }` | `analysisDisplayLegendSettings.Rounding` | Double |
| `Int32 ScaleHeight { get; set; }` | `analysisDisplayLegendSettings.ScaleHeight` | Int32 |
| `Boolean ShowDataDescription { get; set; }` | `analysisDisplayLegendSettings.ShowDataDescription` | Boolean |
| `Boolean ShowDataName { get; set; }` | `analysisDisplayLegendSettings.ShowDataName` | Boolean |
| `Boolean ShowLegend { get; set; }` | `analysisDisplayLegendSettings.ShowLegend` | Boolean |
| `Boolean ShowUnits { get; set; }` | `analysisDisplayLegendSettings.ShowUnits` | Boolean |
| `ElementId TextTypeId { get; set; }` | `analysisDisplayLegendSettings.TextTypeId` | ElementId |
| `Void Dispose()` | `analysisDisplayLegendSettings.Dispose()` | Void |
| `Boolean IsEqual(AnalysisDisplayLegendSettings)` | `analysisDisplayLegendSettings.IsEqual(other)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```